[{"id":1,"name":"Blog website with Astro","link":"https://blog-lovat-delta.vercel.app/","repo_link":"https://github.com/birdfromhell/blog","date":"2022","image":"https://res.cloudinary.com/dqbcy7jki/image/upload/v1766259341/portfolio/projects/blog.png","image_ext":"png","technos":["Astro.js","Vercel"],"type":["web"],"content_en":"A fast and modern blog website built using Astro.js and deployed on Vercel. This project focuses on performance, clean UI, and static site generation. It features markdown-based content management, responsive design, and smooth navigation. Building this site helped me understand the benefits of static-first architecture and modern web development workflows.\n","content_id":"Sebuah website blog yang cepat dan modern yang dibangun menggunakan Astro.js dan di-deploy di Vercel. Proyek ini berfokus pada performa, antarmuka yang bersih, dan pembuatan situs statis. Fitur-fitur utamanya mencakup manajemen konten berbasis markdown, desain responsif, dan navigasi yang lancar. Membangun situs ini membantu saya memahami manfaat arsitektur static-first dan alur kerja pengembangan web modern.\n","created_at":"2025-12-15 09:19:07.345392+00","updated_at":"2025-12-15 09:19:07.345392+00"},{"id":2,"name":"Accountant Software","link":"","repo_link":"","date":"2022","image":"https://res.cloudinary.com/dqbcy7jki/image/upload/v1766259343/portfolio/projects/erka.png","image_ext":"png","technos":["Laravel","Bootstrap","Vue.js","MySql"],"type":["web"],"content_en":"Accountant Software is a web-based application designed to manage financial records, track income and expenses, generate reports, and support business accounting needs. Built using Laravel for backend, Vue.js for dynamic frontend interactions, and Bootstrap for responsive UI, this project provided valuable experience in developing full-stack business applications.","content_id":"Accountant Software adalah aplikasi berbasis web yang dirancang untuk mengelola catatan keuangan, melacak pemasukan dan pengeluaran, menghasilkan laporan, serta mendukung kebutuhan akuntansi bisnis. Dibangun menggunakan Laravel untuk backend, Vue.js untuk interaksi frontend yang dinamis, dan Bootstrap untuk antarmuka yang responsif, proyek ini memberikan pengalaman berharga dalam mengembangkan aplikasi bisnis full-stack.","created_at":"2025-12-15 09:19:07.360097+00","updated_at":"2025-12-15 09:19:07.360097+00"},{"id":4,"name":"Flappy Bird Game","link":"","repo_link":"https://github.com/birdfromhell/FlappyBird_WithPython","date":"2022","image":"https://res.cloudinary.com/dqbcy7jki/image/upload/v1766259344/portfolio/projects/flappy.png","image_ext":"png","technos":["Python"],"type":["game","featured","destkop"],"content_en":"A desktop clone of the classic Flappy Bird game built using Python and Pygame. This project helped me understand core game development concepts such as game loops, collision detection, event handling, and sprite animation. It was a fun and rewarding way to dive into 2D game development.","content_id":"Clone desktop dari game klasik Flappy Bird yang dibuat menggunakan Python dan Pygame. Proyek ini membantu saya memahami konsep dasar pengembangan game seperti game loop, deteksi tabrakan, penanganan event, dan animasi sprite. Ini merupakan cara yang menyenangkan dan bermanfaat untuk mempelajari pengembangan game 2D.","created_at":"2025-12-15 09:19:07.382163+00","updated_at":"2025-12-15 09:19:07.382163+00"},{"id":5,"name":"News Portal Website","link":"","repo_link":"https://github.com/birdfromhell/NewsPortal","date":"2023","image":"https://res.cloudinary.com/dqbcy7jki/image/upload/v1766259346/portfolio/projects/news.png","image_ext":"png","technos":["Django","Bootstrap"],"type":["web"],"content_en":"News Portal Website is a dynamic web application developed using Django and Bootstrap, designed to deliver news content efficiently and attractively. The platform supports features such as article management, categorized news sections, user authentication, and an admin dashboard for content moderation. This project showcases my backend development skills with Django and frontend styling with Bootstrap.\n","content_id":"News Portal Website adalah aplikasi web dinamis yang dikembangkan menggunakan Django dan Bootstrap, dirancang untuk menyajikan konten berita secara efisien dan menarik. Platform ini mendukung fitur seperti manajemen artikel, kategori berita, autentikasi pengguna, dan dashboard admin untuk moderasi konten. Proyek ini menunjukkan kemampuan saya dalam pengembangan backend dengan Django dan penataan frontend dengan Bootstrap.\n","created_at":"2025-12-15 09:19:07.392759+00","updated_at":"2025-12-15 09:19:07.392759+00"},{"id":6,"name":"Notepad App","link":"","repo_link":"https://github.com/birdfromhell/NotepadCloneWithJava","date":"2022","image":"https://res.cloudinary.com/dqbcy7jki/image/upload/v1766259363/portfolio/projects/selerarasasunda.png","image_ext":"png","technos":["Java"],"type":["desktop"],"content_en":"A simple Notepad application built with Java Swing. It includes basic text editing features such as creating, opening, saving, and editing files. This project taught me about GUI layout management, event-driven programming, and working with file I/O in Java.","content_id":"Aplikasi Notepad sederhana yang dibuat dengan Java Swing. Mencakup fitur dasar pengeditan teks seperti membuat, membuka, menyimpan, dan mengedit file. Proyek ini mengajarkan saya tentang manajemen tata letak GUI, pemrograman berbasis event, dan bekerja dengan I/O file di Java.","created_at":"2025-12-15 09:19:07.444986+00","updated_at":"2025-12-15 09:19:07.444986+00"},{"id":7,"name":"Payment Gateway Landing Pages","link":"https://payment-gateway-landingpage.vercel.app/","repo_link":"https://github.com/birdfromhell/payment-gateway-landingpage","date":"2023","image":"https://res.cloudinary.com/dqbcy7jki/image/upload/v1766259367/portfolio/projects/payment.png","image_ext":"png","technos":["Next.js","Vercel"],"type":["web"],"content_en":"A modern and responsive landing page designed for a fictional payment gateway service. Built using Next.js and styled with Tailwind CSS, this project demonstrates my skills in frontend development, responsive layout design, and UI/UX presentation. It features sections such as service highlights, pricing plans, testimonials, and a call-to-action area.\n","content_id":"Sebuah landing page modern dan responsif yang dirancang untuk layanan payment gateway fiktif. Dibuat menggunakan Next.js dan Tailwind CSS, proyek ini menunjukkan kemampuan saya dalam pengembangan frontend, desain layout responsif, dan penyajian UI/UX. Halaman ini mencakup bagian highlight layanan, paket harga, testimoni, dan call-to-action.\n","created_at":"2025-12-15 09:19:07.454997+00","updated_at":"2025-12-15 09:19:07.454997+00"},{"id":8,"name":"Portfolio Website","link":"https://ababil.is-not-a.dev","repo_link":"https://github.com/birdfromhell/Myportfolio-website","date":"2023","image":"https://res.cloudinary.com/dqbcy7jki/image/upload/v1766259370/portfolio/projects/portfolio.png","image_ext":"png","technos":["Nuxt.js","Wakatime"],"type":["web","featured"],"content_en":"A personal portfolio website built to showcase my projects, skills, and background. I used Nuxt.js to create a clean, responsive, and fast web application. Through this project, I learned how to structure a scalable front-end application, optimize performance, and improve user experience with smooth transitions and responsive layouts.","content_id":"Website portofolio pribadi yang dibuat untuk menampilkan proyek, keahlian, dan latar belakang saya. Saya menggunakan Nuxt.js untuk membangun aplikasi web yang bersih, responsif, dan cepat. Lewat proyek ini, saya belajar bagaimana menyusun aplikasi front-end yang skalabel, mengoptimalkan performa, serta meningkatkan pengalaman pengguna dengan transisi yang halus dan tata letak yang responsif.","created_at":"2025-12-15 09:19:07.465673+00","updated_at":"2025-12-15 09:19:07.465673+00"},{"id":9,"name":"Selera Rasa Sunda","link":"https://selera-rasa-sunda.id","repo_link":"closed","date":"2024","image":"https://res.cloudinary.com/dqbcy7jki/image/upload/v1766259363/portfolio/projects/selerarasasunda.png","image_ext":"png","technos":["Laravel","Php","MySql","Bootstrap"],"type":["web","featured"],"content_en":"A clean and responsive landing page for a food catering business. This project focuses on presenting services, menus, and contact information in a visually appealing and user-friendly way. I focused on layout design, content hierarchy, and call-to-action buttons to increase user engagement and trust.","content_id":"Landing page yang bersih dan responsif untuk bisnis katering makanan. Proyek ini berfokus pada penyajian layanan, menu, dan informasi kontak secara menarik dan mudah diakses. Saya memusatkan perhatian pada desain tata letak, hirarki konten, dan tombol ajakan bertindak (CTA) untuk meningkatkan keterlibatan pengguna dan kepercayaan pelanggan.","created_at":"2025-12-15 09:19:07.51195+00","updated_at":"2025-12-15 09:19:07.51195+00"},{"id":11,"name":"Linux On Web","link":"https://linux-on-web.vercel.app/","repo_link":"https://github.com/zuckdorsey/blug-exercise-v2","date":"2025","image":"https://res.cloudinary.com/dqbcy7jki/image/upload/v1769612837/portfolio/h2ys4t1tvuyqsfycltmp.png","image_ext":"png","technos":["NPM","Vercel","Vue.js"],"type":["web"],"content_en":"An interactive educational platform that simulates a Linux desktop experience directly in the browser. Built with React 18 and Vite, this project features a dynamic window management system, an interactive terminal, and real-time interface customization. It aims to introduce the Linux ecosystem to beginners through a familiar and responsive GUI.An interactive educational platform that simulates a Linux desktop experience directly in the browser. Built with React 18 and Vite, this project features a dynamic window management system, an interactive terminal, and real-time interface customization. It aims to introduce the Linux ecosystem to beginners through a familiar and responsive GUI.","content_id":null,"created_at":"2026-01-28 15:07:19.998324+00","updated_at":"2026-01-28 15:07:19.998324+00"}]